Revit 2027 API
RebarBendingDetailType.SchematicHeight Property
 Determine the height of the box where the schematic Bending Detail will be represented.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double SchematicHeight { get; set; }
Public Property SchematicHeight As Double
	Get
	Set
public:
property double SchematicHeight {
	double get ();
	void set (double value);
}
member SchematicHeight : float with get, set
Property Value
Double
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: The given value for schematicHeight must be greater than 0 and no more than 30000 feet.
InvalidOperationException |  When setting this property:
See Also
Reference
RebarBendingDetailType Class
Autodesk.Revit.DB.Structure Namespace